socialNetwork/wrk2/test-run-721/COMMAND_8/24
Running 1m test @ http://localhost:31111/wrk2-api/home-timeline/read
  2 threads and 2 connections
  Thread calibration: mean lat.: 0.709ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.727ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency   725.65us  177.42us   1.15ms   83.05%
    Req/Sec   526.65     65.09   666.00     64.04%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  709.00us
 75.000%  797.00us
 90.000%    0.89ms
 99.000%    1.15ms
 99.900%    2.37ms
 99.990%    5.38ms
 99.999%    6.66ms
100.000%    6.66ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.314     0.000000            1         1.00
       0.560     0.100000         5067         1.11
       0.609     0.200000        10055         1.25
       0.647     0.300000        15074         1.43
       0.679     0.400000        20013         1.67
       0.709     0.500000        25114         2.00
       0.724     0.550000        27558         2.22
       0.741     0.600000        30046         2.50
       0.758     0.650000        32533         2.86
       0.777     0.700000        35083         3.33
       0.797     0.750000        37599         4.00
       0.808     0.775000        38821         4.44
       0.821     0.800000        40078         5.00
       0.834     0.825000        41248         5.71
       0.850     0.850000        42497         6.67
       0.869     0.875000        43777         8.00
       0.880     0.887500        44399         8.89
       0.892     0.900000        45015        10.00
       0.906     0.912500        45652        11.43
       0.922     0.925000        46272        13.33
       0.940     0.937500        46877        16.00
       0.950     0.943750        47189        17.78
       0.962     0.950000        47503        20.00
       0.976     0.956250        47820        22.86
       0.993     0.962500        48122        26.67
       1.011     0.968750        48435        32.00
       1.024     0.971875        48593        35.56
       1.036     0.975000        48752        40.00
       1.053     0.978125        48912        45.71
       1.068     0.981250        49062        53.33
       1.088     0.984375        49216        64.00
       1.096     0.985938        49292        71.11
       1.114     0.987500        49371        80.00
       1.140     0.989062        49454        91.43
       1.159     0.990625        49528       106.67
       1.187     0.992188        49606       128.00
       1.208     0.992969        49645       142.22
       1.228     0.993750        49684       160.00
       1.255     0.994531        49722       182.86
       1.297     0.995313        49761       213.33
       1.389     0.996094        49800       256.00
       1.441     0.996484        49820       284.44
       1.494     0.996875        49839       320.00
       1.556     0.997266        49859       365.71
       1.655     0.997656        49878       426.67
       1.741     0.998047        49898       512.00
       1.857     0.998242        49908       568.89
       1.966     0.998437        49917       640.00
       2.119     0.998633        49927       731.43
       2.221     0.998828        49937       853.33
       2.393     0.999023        49947      1024.00
       2.589     0.999121        49952      1137.78
       2.909     0.999219        49956      1280.00
       3.109     0.999316        49961      1462.86
       3.407     0.999414        49966      1706.67
       3.645     0.999512        49971      2048.00
       3.833     0.999561        49974      2275.56
       3.991     0.999609        49976      2560.00
       4.203     0.999658        49978      2925.71
       4.375     0.999707        49981      3413.33
       4.479     0.999756        49983      4096.00
       4.611     0.999780        49985      4551.11
       4.659     0.999805        49986      5120.00
       4.787     0.999829        49987      5851.43
       5.159     0.999854        49988      6826.67
       5.251     0.999878        49989      8192.00
       5.375     0.999890        49990      9102.22
       5.879     0.999902        49991     10240.00
       5.879     0.999915        49991     11702.86
       5.947     0.999927        49992     13653.33
       5.947     0.999939        49992     16384.00
       6.435     0.999945        49993     18204.44
       6.435     0.999951        49993     20480.00
       6.435     0.999957        49993     23405.71
       6.459     0.999963        49994     27306.67
       6.459     0.999969        49994     32768.00
       6.459     0.999973        49994     36408.89
       6.459     0.999976        49994     40960.00
       6.459     0.999979        49994     46811.43
       6.659     0.999982        49995     54613.33
       6.659     1.000000        49995          inf
#[Mean    =        0.726, StdDeviation   =        0.177]
#[Max     =        6.656, Total count    =        49995]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  59997 requests in 1.00m, 11.39MB read
Requests/sec:    999.97
Transfer/sec:    194.33KB